_posts/2022-02-02-boj-1389.html
---
title: BOJ 1389 케빈 베이컨의 6단계 법칙
tags: 최단거리
toc: true
toc_sticky: true
---

<div id="outline-container-org1d876a8" class="outline-2">
<h2 id="org1d876a8">BOJ 1389 케빈 베이컨의 6단계 법칙</h2>
<div class="outline-text-2" id="text-org1d876a8">
<ul class="org-ul">
<li>BFS로 최단거리 -&gt; 깊이</li>
</ul>
</div>
</div>

<div id="outline-container-org5003689" class="outline-2">
<h2 id="org5003689">접근하기</h2>
<div class="outline-text-2" id="text-org5003689">
<pre class="example">
N이 100 

1~N만큼 BFS를 구동해서, 찾는다.
</pre>
</div>
</div>

<div id="outline-container-orgcb9e473" class="outline-2">
<h2 id="orgcb9e473">코드</h2>
<div class="outline-text-2" id="text-orgcb9e473">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">id</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dist</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">G</span>[101];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">bfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">start</span>)
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">vis</span>[101] = {0, };    
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[101] = {0, };    
    <span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">q</span>;
    q.push({start, 0});
    vis[start] = 1;
    dp[start] = 0;

    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">o</span> : G[cur.id]) {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">nid</span> = o.id;
            <span style="color: #729fcf; font-weight: bold;">if</span> (vis[nid] == 0) {
                vis[nid] = 1;
                dp[nid] = cur.dist +1;
                q.push({nid, cur.dist +1}); 
            } 
        }
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        sum += dp[i];
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> sum;
}


<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    FASTIO;
    <span style="color: #888a85;">//</span><span style="color: #888a85;">freopen("input.txt", "r", stdin);</span>
    cin &gt;&gt; N &gt;&gt; M;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        cin &gt;&gt; p1 &gt;&gt; p2;
        G[p1].push_back({p2, 0});
        G[p2].push_back({p1, 0});
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val</span> = 987654321;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = -1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ret</span> = bfs(i);
        <span style="color: #729fcf; font-weight: bold;">if</span> (val &gt; ret) {
            val = ret;
            ans = i;
        }
    }
    cout &lt;&lt; ans &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f55d88" class="outline-2">
<h2 id="org6f55d88">문제 링크</h2>
<div class="outline-text-2" id="text-org6f55d88">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1389">https://www.acmicpc.net/problem/1389</a></li>
</ul>
</div>
</div>
